Revit 2024 API
BuiltInFailures.SketchFailures.NotOneCurvePath3d Property
 More than one curve not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotOneCurvePath3d { get; }
Visual Basic
Public Shared ReadOnly Property NotOneCurvePath3d As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotOneCurvePath3d {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace